0/DBU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pB;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [-1 -1 2 0 0 2 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
	    value           $internalField;
    }
    outlet
    {
        type            calculated;
	    value           $internalField;
    }
    Wall_side
    {
        type            calculated;
	    value           $internalField;
    }
    Wall_out
    {
        type            calculated;
	    value           $internalField;
    }
	Wall_inside
	{
		type			calculated;
		value			$internalField;
	}

}


// ************************************************************************* //
