0/pB
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pB;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;	
    }
    outlet
    {
        type            zeroGradient;
    }
    Wall_side
    {
        type            zeroGradient;
    }
    Wall_out
    {
        type            zeroGradient;
    }
    Wall_inside
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
